Added README for clarity
